<a href="https://colab.research.google.com/github/rescolo/notas/blob/master/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pandas

From http://pandas.pydata.org/pandas-docs/stable/

pandas is a Python package providing fast, flexible, and expressive data structures designed to make working with “relational” or “labeled” data both easy and intuitive. It aims to be the fundamental high-level building block for doing practical, real world data analysis in Python. Additionally, it has the broader goal of becoming the most powerful and flexible open source data analysis / manipulation tool available in any language. It is already well on its way toward this goal.

See also:

* https://github.com/restrepo/data-analysis
  * https://classroom.github.com/g/sSMBdBqN
  * https://classroom.github.com/a/PcbQBE7F
* https://github.com/restrepo/PythonTipsAndTricks

A good and practice book about `Pandas` possibilities is:

[__Python for Data Analysis__](https://drive.google.com/open?id=0BxoOXsn2EUNIWExXbVc4SDN0YTQ)<br/>
Data Wrangling with Pandas, NumPy, and IPython<br/>
_By William McKinney_


This other is about aplications based on `Pandas`:
![image.png](https://covers.oreillystatic.com/images/0636920030515/cat.gif) [Introduction to Machine Learning with Python](https://drive.google.com/open?id=0BxoOXsn2EUNISGhrdEZ3S29fS3M)<br/>
A Guide for Data Scientists
By Sarah Guido, Andreas Müller

`Pandas` can be used in a similar way to `R`, which is based on similar data structures. `Pandas` also can replace the use of graphical interfaces to access spreadsheets like Excel

## Standard way to load the module

In [0]:
import pandas as pd

## Basic structure: DataFrame

An flat _spreadsheet_ can be seen in terms of the types of variables of `Python` just as dictionary of lists, where each column of the spreadsheet is a pair key-list of the dictionary 

|   |  A   |  B   |
|---|:----:|:----:|
| 1 | even | odd  |
| 2 |   0  | 1    |
| 3 |   2  | 3    |
| 4 |   4  | 5    |
| 5 |   6  | 7    |
| 6 |   8  | 9    |

In [0]:
numbers={"even": [0,2,4,6,8],   #  First  key-list
         "odd" : [1,3,5,7,9] }  #  Second key-list

## Data structures

`Pandas` has two new data structures:
1. `DataFrame` which are similar to numpy arrays but with some assigned key. For example, for the previous case
```python
import numpy as np
np.array([[0,1],
             [2,3],
             [4,5],
             [6,7],
             [8,9] 
         ])
```
1. `Series` which are enriched  to dictionaries, as the ones defined for the rows of the previous example: `{'even':0,'odd':1}`.


The rows in a two-dimensional `DataFrame` corresponds to `Series` with similar keys, while the columns are also Series with the indices as keys. 

An example of a  `DataFrame` is a spreadsheet, as the one before.

### `DataFrame`
`Pandas` can convert a dictionary of lists, like the `numbers` dictionary before, into a `DataFrame`, which is just an spreadsheet but interpreted at the programming level:

In [4]:
import pandas as pd
pd.set_option('display.max_colwidth',200)
df=pd.DataFrame(numbers)
df

   even  odd
0     0    1
1     2    3
2     4    5
3     6    7
4     8    9

It is equivalent to:

In [5]:
pd.DataFrame.from_dict(numbers)

   even  odd
0     0    1
1     2    3
2     4    5
3     6    7
4     8    9

See below for other possibilities of [creating Pandas DataFrames from lists and dictionaries](https://fisica.udea.edu.co:4443/user/restrepo/notebooks/prog/cursos/data-analysis/Pandas.ipynb#Intialization-from-lists-and-dictionaries)

The main advantage of the `DataFrame`, `df`, is that it can be managed without a graphical interface.

We can check the shape of the `DataFrame`

In [6]:
df.shape

(5, 2)

####  Export DataFrame to other formats
* To export to excel:

In [0]:
df.to_excel('example.xlsx',index=False)

__Activity__: Open the resulting spreadsheet in Google Drive, publish it and open from the resulting link with Pandas in the next cell

In [9]:
df=pd.read_excel('https://docs.google.com/spreadsheets/d/e/2PACX-1vR3TVEul7rdqLL6CH3u9IY9C50Oo7IpftW0RZy_Do_5qM3w2CbektKeaMKpW15SUA/pub?output=xlsx')
df

   even  odd
0     0    1
1     2    3
2     4    5
3     6    7
4     8    9
5    10   11

In [11]:
df['even']

0     0
1     2
2     4
3     6
4     8
5    10
Name: even, dtype: int64

### `Series`

Each column of the DataFrame is now an augmented dictionary called `Series`, with the indices as the keys of the `Series`

A `Pandas` `Series` object can be just initialized from a `Python` dictionary:

In [12]:
type( df['even'] )

pandas.core.series.Series

The keys are the index of the `DataFrame`

In [14]:
df.odd

0     1
1     3
2     5
3     7
4     9
5    11
Name: odd, dtype: int64

In [0]:
df.even[3]

6

Each row is also a series

In [15]:
df.loc[0]

even    0
odd     1
Name: 0, dtype: int64

with keys: `'even'` and `'odd'`

In [17]:
df.loc[4]['even']

8

In [18]:
df.loc[3,'odd']

7

or attributes `even` and `odd`

In [0]:
df.loc[0].odd

1

One specific cell value can be reached with the index and the key:

In [0]:
df.loc[2,'odd']

5

In [19]:
s=pd.Series({'Name':'Juan Valdez',
             'Nacionality':'Colombia',
             'Age':23})
s

Name           Juan Valdez
Nacionality       Colombia
Age                     23
dtype: object

*Note* that the key name can be used also as an attribute.

In [20]:
s.Age

23

> The __power__ of Pandas rely in that their main data structures: `DataFrames` and `Series`, are enriched with many useful methods and attributes.

### [Official definition of Pandas](http://pandas.pydata.org/pandas-docs/stable/)

> Pandas is a Python package providing __fast__, __flexible__, and __expressive__ _data structures_ designed to make working with “relational” or “labeled” data both easy and intuitive. It aims to be the fundamental high-level building block for doing practical, real world data analysis in Python. Additionally, it _has the broader goal of becoming the most powerful and flexible open source data analysis / manipulation tool_ available in any language. It is already well on its way toward this goal.

* "relational": the list of data is identified with some unique index (like a `SQL` table)
* "labeled": the list is identified with a key, like the previous `odd` or `even` keys.

For example. A double bracket `[[...]]`, can be used to filter data.

A row in a two-dimensional `DataFrame` corresponds to `Series` with the same keys of the `DataFrame`, but with single values instead of a list

In [0]:
df.loc[[0]]

   even  odd
0     0    1

In [0]:
print( 'the row has' )
print( '                  keys: {} and values: {}'.format( list( df.loc[[0]].keys() ),df.loc[[0]].values[0]  ) )
print( "like the dictionay:" )
print( "                      { 'even' : 0, 'odd' : 1 }")

the row has
                  keys: ['even', 'odd'] and values: [0 1]
like the dictionay:
                      { 'even' : 0, 'odd' : 1 }

To filter a column:

In [0]:
df[['odd']]

   odd
0    1
1    3
2    5
3    7
4    9

### More on `Series`

A `Pandas` `Series` object can be just initialized from a `Python` dictionary:

In [21]:
s=pd.Series({'Name':'Juan Valdez',
             'Nacionality':'Colombia',
             'Age':23})
s

Name           Juan Valdez
Nacionality       Colombia
Age                     23
dtype: object

In [22]:
s['Name']

'Juan Valdez'

but also as containers of name spaces!

In [23]:
s.Name

'Juan Valdez'

## `DataFrame` initialization

### Initization from an existing spreadsheet. 
This can be locally in your computer o from some downloadable  link

In [24]:
df=pd.read_excel('http://bit.ly/spreadsheet_xlsx')
df

               Nombre  Edad                Compañia
0         Juan Valdez    23        Café de Colombia
1  Álvaro Uribe Vélez    65  Senado de la República

To make a downloadable link for any spread sheet in Google Drive, follow the sequence:
```
File → Publish to the web...→ Entire Document → Web page → Microsoft excel (xlsx)
```
as illustrated in the figure:
![GS](https://github.com/restrepo/data-analysis/blob/master/img/img1.png?raw=1)

In [25]:
df.loc[0,'Ed'Nombre':,'Edad':,'Compañía':ad']=32
df

               Nombre  Edad                Compañia
0         Juan Valdez    32        Café de Colombia
1  Álvaro Uribe Vélez    65  Senado de la República

*After* some modification

it can be saved again as an `excel file` with the option to not create a column of indices: `index=False`

### Intialization from lists and dictionaries

#### Inizialization from Series
We start with an empty `DataFrame`:

Creating Pandas DataFrame from list and dictionaries [offers many alternatives](http://pbpython.com/pandas-list-dict.html)

![creating dataframes](http://pbpython.com/images/pandas-dataframe-shadow.png)

#### Row oriented way
* In addition to the dictionary of lists [already illustrated at the beginning]() that in this case corresponds to:

In [28]:
df=pd.DataFrame({'Nombre'   : ['Juan Valdez','Álvaro Uribe Vélez'],
           'Nombre':,'Edad':,'Compañía':   'Edad'     : [32,            65                 ],
              'Compañia' : ['Café de Colombia','Senado de la República']})
df

               Nombre  Edad                Compañia
0         Juan Valdez    32        Café de Colombia
1  Álvaro Uribe Vélez    65  Senado de la República

* We can obtain the DataFrame from list of items

In [0]:
pd.DataFrame.from_items([ [ 'Nombre'  , ['Juan Valdez','Álvaro Uribe Vélez']],
                          [ 'Edad'    , [  32,            65               ]],
                      'Nombre':,'Edad':,'Compañía':    [ 'Compañia', ['Café de Colombia','Senado de la República']] ])

* We can obtain the `DataFrame` from dictionary

In [0]:
pd.DataFrame( {'Nombre':'Juan Valdez',        'Edad': 32   ,'Compañia':'Café de Colombia'      },
              {'Nombre':'Álvaro Uribe Vélez', 'Edad': 65   ,'Compañia':'Senado de la República'}
            )

               Nombre  Edad          Compañia
Nombre    Juan Valdez    32  Café de Colombia
Edad      Juan Valdez    32  Café de Colombia
Compañia  Juan Valdez    32  Café de Colombia

In [0]:
df=pd.DataFrame()
df'Nombre':,'Edad':,'Compañía':

Empty DataFrame
Columns: []
Index: []

In [29]:
df

               Nombre  Edad                Compañia
0         Juan Valdez    32        Café de Colombia
1  Álvaro Uribe Vélez    65  Senado de la República

Actividad: Crear el DataFrame desde una lista de diccionarios y agregar una tercera fila

In [31]:
df=pd.DataFrame([ {'Nombre':'Juan Valdez'       ,'Edad':32,'Compañía':'Café de Colombia'},
                  {'Nombre':'Álvaro Uribe Vélez','Edad':64,'Compañía':'Senado de la República'},
                  {'Nombre':'Leonel Messi',      'Edad':31,'Compañía':'Barcelona FC'}                 
])
df

               Nombre  Edad                Compañía
0         Juan Valdez    32        Café de Colombia
1  Álvaro Uribe Vélez    64  Senado de la República
2        Leonel Messi    31            Barcelona FC

### Initialization from sequential rows as  Series
We start with an empty `DataFrame`:

In [47]:
df=pd.DataFrame()
df.empty'Nombre':,'Edad':,'Compañía':

True

We can append a dictionary (or Series) as a row of the `DataFrame`, provided that we always use the option: `ignore_index=True`

In [48]:
d={'Name':'Juan Valdez','Nacionality':'Colombia','Age':23}
df=df.append(d,ignore_index=True)
df

    Age Nacionality         Name
0  23.0    Colombia  Juan Valdez

We can fix the type of data of the `'Age'` column

In [36]:
type(df.loc[0,'Age'])

numpy.float64

In [37]:
df['Age']=df.Age.astype(int)
df'Nombre':,'Edad':,'Compañía':

   Age Nacionality         Name
0   23    Colombia  Juan Valdez

To add a second file we build another `dict`

In [49]:
d={}
for k in ['Name','Naci'Nombre':,'Edad':,'Compañía':onality','Age','Company']:
    var=input('{}:\n'.format(k))
    d[k]=var

Name:
Francisco
Nacionality:
Argentina
Age:
82
Company:
Vaticano

#### Exercises
* Display the resulting `Series` in the screen:

In [50]:
pd.Series(d)'Nombre':,'Edad':,'Compañía':

Name           Francisco
Nacionality    Argentina
Age                   82
Company         Vaticano
dtype: object

* Append to the previous `DataFrame` and visualize it:

In [51]:
df=df.append(pd.Series(d),ignore_index=True)
df

  Age Nacionality         Name   Company
0  23    Colombia  Juan Valdez       NaN
1  82   Argentina    Francisco  Vaticano

* Fill NaN with empty strings

In [52]:
df.loc[0,'Company']='Café de Colombia'
df

  Age Nacionality         Name           Company
0  23    Colombia  Juan Valdez  Café de Colombia
1  82   Argentina    Francisco          Vaticano

* Save `Pandas` `DataFrame` as an Excel file

In [0]:
df.to_csv('trabajadores.csv',index=False)'Nombre':,'Edad':,'Compañía':

* Load pandas DataFrame from the saved file in Excel

In [55]:
pd.read_csv('trabajadores.csv')

    Age Nacionality         Name           Company
0  23.0    Colombia  Juan Valdez  Café de Colombia
1  82.0   Argentina    Francisco          Vaticano

### Common operations upon `DataFrames`
See https://github.com/restrepo/PythonTipsAndTricks

* __To fill a specific cell__

In [0]:
df.loc[0,'Company']='Federación de Caferos'

In [57]:
df

  Age Nacionality         Name                Company
0  23    Colombia  Juan Valdez  Federación de Caferos
1  82   Argentina    Francisco               Vaticano

## Other formats to saving and read files
We are interested in format which keeps the tags of the columns, like `'Nombre', 'Edad', 'Compañia'`

In [0]:
df=pd.read_excel('http://bit.ly/spreadsheet_xlsx')
df

               Nombre  Edad                Compañia
0         Juan Valdez    23        Café de Colombia
1  Álvaro Uribe Vélez    65  Senado de la República

#### CSV

In [0]:
df.to_csv('hoja.csv',index=False)

In [0]:
df

   Age Nacionality         Name
0   23    Colombia  Juan Valdez

We can check the explicit file format with

In [58]:
print(df.to_csv(None,index=False))

Age,Nacionality,Name,Company
23.0,Colombia,Juan Valdez,Federación de Caferos
82,Argentina,Francisco,Vaticano

#### JSON

This format keeps the lists and dictionaries at the storage level

In [59]:
df=pd.DataFrame([{"Name":"Donald Trump","Age":73},
                 {"Name":"Barak Obama", "Age":58}])
df

           Name  Age
0  Donald Trump   73
1   Barak Obama   58

This format allow us to keep exactly the very same list of dictionaries structure!

In [60]:
print(df.to_json(None,orient='records'))

[{"Name":"Donald Trump","Age":73},{"Name":"Barak Obama","Age":58}]

__Activity__: 
* Save to a file instead of `None` and open the file with some editor.

In [0]:
df.to_json('kk.json',orient='records')

* Add a break-line at the end of the first dictionary and try to
load the resulting file with `pd.read_json`

In [62]:
pd.read_json('kkk.json',orient='records')

           Name  Age
0  Donald Trump   73
1   Barak Obama   58

JSON allows for some flexibility in the break-lines structure:

In [63]:
pd.read_json('''
             [{"Name":"Donald Trump","Age":73},
              {"Name":"Barak Obama", "Age":58}]
            ''')

           Name  Age
0  Donald Trump   73
1   Barak Obama   58

For large databases it is convinient just to accumulate dictionaries in a sequential form:

In [64]:
print(df.to_json(None,orient='records',lines=True))

{"Name":"Donald Trump","Age":73}
{"Name":"Barak Obama","Age":58}

In [66]:
df=pd.read_json('''
             {"Name":"Donald Trump","Age":73}
             {"Name":"Barak Obama", "Age":58}
            ''',orient='records',lines=True)
df

           Name  Age
0  Donald Trump   73
1   Barak Obama   58

__Activity__: 
* Save to a file instead of `None`, with options: `orient='records',lines=True`, and open the file with some editor.

In [0]:
df.to_json('kkkk.json',orient='records',lines=True)

* Add a similar dictionary in the next new line, and try to
load the resulting file with `pd.read_json` with options: `orient='records',lines=True`. 
   * WARNING: Use doble-quotes `"` to write the keys od the new
dictionary

In [69]:
pd.read_json('kkkkk.json',orient='records',lines=True)

              Name  Age
0     Donald Trump   73
1      Barak Obama   58
2  John F. Kennedy   51

Any Python string need to be converted first to double-quotes before to be used as JSON string.

__Example__

In [0]:
numbers={"even": [0,2,4,-6,8],   #  First  key-list
         "odd" : [1,3,-5,7,9] }  #  Second key-list

In [76]:
str(numbers)

"{'even': [0, 2, 4, -6, 8], 'odd': [1, 3, -5, 7, 9]}"

This string can be writing in the `JSON` format by replacing the single quotes, ' , by  duoble quotes, ":

In [0]:
h='hola mundo'

In [78]:
h.replace('hola','Hola')

'Hola mundo'

In [79]:
str(numbers).replace("'",'"')

'{"even": [0, 2, 4, -6, 8], "odd": [1, 3, -5, 7, 9]}'

and now can be used as an JSON input

In [80]:
df=pd.read_json(  str(numbers).replace("'",'"') )
df

   even  odd
0     0    1
1     2    3
2     4   -5
3    -6    7
4     8    9

__Activity__: Try to read the string as JSON without make the double-quote replacement

## Filters
The main application of labeled data for data analysis is the possibility to make filers, or cuts, to obtain specific reduced datasets to further analysis

In [81]:
df[df.even.abs()>4]

   even  odd
3    -6    7
4     8    9

In [82]:
#and
df[(df.even>0) & (df.odd<0)]

   even  odd
2     4   -5

In [83]:
#or
df[(df.even<0) | (df.odd<0)]

   even  odd
2     4   -5
3    -6    7

## The `apply` method
The advantage of the spreadsheet paradigm is that the columns can be transformed with functions. All the typical functions avalaible for a spreadsheet are already implemented like the method `.abs()` used before, or the method: `.sum()`

In [84]:
df.even.sum()

8

__Activity__: Explore the avalaible methods by using the completion system of the notebook after the last semicolon of `df.even.`

In [0]:
df.

In addittion, for the `DataFrame` paradigm, we can easy implement any other function directly at the programming level either along the columns or along the rows

### Column-level `apply`
We just select the column and apply the direct or implicit function:
* Pre-defined function

In [85]:
df.even.apply(abs)

0    0
1    2
2    4
3    6
4    8
Name: even, dtype: int64

* Implicit function

In [86]:
df.even.apply(lambda n:isinstance(n,int))

0    True
1    True
2    True
3    True
4    True
Name: even, dtype: bool

### Row-level apply
The foll row is passed as dictionary to the explicit or implicit function when `apply` is used for the full `DataFrame` and the option `axis=1` is used at the end

In [0]:
df.apply(lambda row: row['even']+row['odd'])

0     1
1     5
2    -1
3     1
4    17
dtype: int64

## Non-relational databases

We have shown that the simple two dimensional spreadsheets where each cell values is a simple type like string, integer, or float, can be represented as a dictionary of lists values or a list of dictionary column-value assignment. 

We can go further and allow to store in the value itself a more general data structure, like nested lists and dictionaries. This allows advanced data-analysis when the `apply` methos is used to operate inside the nested lists or dictionaries.

See for example:

##  Machine web
There are really three kinds of web
* The normal web, 
* The deep web,
* _The machine web_. The web for machine readable responses. It is served in `JSON` or `XML`  formats, which preserve programming objects.

For example, consider the following normal web page:

http://inspirehep.net/search?p=doi:10.1103/PhysRevLett.122.132001

about a Scientific paper with people from the University of Antioquia. A _machine web_ version can be easily obtained in JSON just by attaching the extra parameter `&of=recjson`, and direcly loaded from Pandas, which works like a _browser for the third web_:

In [0]:
df=pd.read_json('http://inspirehep.net/search?p=doi:10.1103/PhysRevLett.122.132001&of=recjson')

In [88]:
df

                                                                                                                                                                                                   comment  ...          prepublication
0  Submitted to Phys. Rev. Lett. All figures and tables can be found at http://cms-results.web.cern.ch/cms-results/public-results/publications/BPH-18-007 (CMS Public Pages). This version corrects the...  ...  {'date': '2019-02-01'}

[1 rows x 35 columns]

We can see that the column `authors` is quite nested: Is a list of dictionaries with the full information for each one of the authors of the article.

In [89]:
df.authors

0    [{'INSPIRE_number': 'INSPIRE-00312131', 'affiliation': 'Yerevan Phys. Inst.', 'first_name': 'Albert M', 'last_name': 'Sirunyan', 'full_name': 'Sirunyan, Albert M'}, {'INSPIRE_number': 'INSPIRE-001...
Name: authors, dtype: object

__Activity__: Check that the lenght of the auhors list coincides with the `number_of_authors` 
<!-- df.authors.apply(len),df.number_of_authors.values -->

In [95]:
df.authors.apply(len)

0    2279
Name: authors, dtype: int64

In [94]:
df.loc[0,'number_of_authors']

2279

In [97]:
df.authors.str[0]

0    {'INSPIRE_number': 'INSPIRE-00312131', 'affiliation': 'Yerevan Phys. Inst.', 'first_name': 'Albert M', 'last_name': 'Sirunyan', 'full_name': 'Sirunyan, Albert M'}
Name: authors, dtype: object

 We can use all the previous methods to extract the authors from `'Antioquia U.'`:
 
 Note: For a dictionary, `d` is safer to use `d.get('key')` instead of just `d['key']` to obtain some `key`, because not error is generated if the requested `key` does not exists at all

In [99]:
df.authors.apply(lambda l:  #implicit function
                           [ d.get('full_name') #safer way to obtain a `key` value
                             for d in l   #comprehension list 
                               if isinstance(d,dict) and d.get('affiliation')=='Antioquia U.' #condition
                           ] 
                             if isinstance(l,list) else None #  Be sure that cell have the proper format
                 )

0    [Mejia Guisao, Jhovanny, Ruiz Alvarez, José David]
Name: authors, dtype: object

A simpler version is possible,  but is more prompted to error when used through multiple column entries:

In [98]:
df.authors.apply(lambda l: [ d['full_name'] for d in l   
                              if d['affiliation']=='Antioquia U.'
                           ] )

0    [Mejia Guisao, Jhovanny, Ruiz Alvarez, José David]
Name: authors, dtype: object

For further details see: https://github.com/restrepo/inspire/blob/master/gfif.ipynb

##  ACTIVITIES
See:
* https://github.com/ajcr/100-pandas-puzzles
* https://github.com/guipsamora/pandas_exercises

## Final remarks
With basic scripting and Pandas we already have a solid environment to analyse data. We introduce the other libraries motivated with the extending the capabilities of Pandas